# IS362 - Project 3

Your assignment involves combining information from a number of SQL tables,
then displaying the information in a pandas DataFrame.
For your relational database management system, you may use any RDBMS,
including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by
the database in Step 1 below.
1. For your database, you should download and install the appropriate version
of the Chinook database for your RDBMS, which is available here, under the
downloads tab: https://chinookdatabase.codeplex.com/
2. Your task is to create a pandas DataFrame that displays Customers’ Last
Name and First Name, and each customer’s purchased Track names and
Album Titles. The information should be sorted by Customer LastName
then Customer FirstName. The first five rows of your results should look
like this:

In [6]:
from IPython.display import Image
from IPython.core.display import HTML 
Image(url="C:/Users/Jessica/Desktop/John's School/IS362/IS362_Project3/solution.PNG")

As always, the first step is to import any modules necessary for completing this assignment:

In [19]:
import pandas as pd
import numpy as np
import sqlite3

Next, I need to connect to the database. I initially chose to use MySQL because it was already installed and running on my computer, but for some reason it threw an error when I tried to connect to the database that way, so I went for Sqlite instead. (I had to adjust my imports accordingly)

In [23]:
con = sqlite3.connect("C:/Users/Jessica/Downloads/ChinookDatabase1.4_CompleteVersion/Chinook_Sqlite.sqlite")

Now, I have to write a SQL query that will return the data we need. We're looking to create a pandas DataFrame with customer Last Names, First Names, Track Names, and Album Titles. The schema we're working with looks like this:

In [10]:
Image(url='http://lh4.ggpht.com/_oKo6zFhdD98/SWFPtyfHJFI/AAAAAAAAAMc/GdrlzeBNsZM/s800/ChinookDatabaseSchema1.1.png')

In [21]:
sql = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title
         FROM Customer
         LEFT JOIN Invoice
         ON Customer.CustomerId = Invoice.CustomerId
         LEFT JOIN InvoiceLine
         ON Invoice.InvoiceId = InvoiceLine.InvoiceId
         LEFT JOIN Track
         ON InvoiceLine.TrackId = Track.TrackId
         LEFT JOIN Album
         ON Track.AlbumId = Album.AlbumId
         ORDER BY Customer.LastName, Customer.FirstName'''

Now that we've connected to the database, and written the SQL query that will get us the data we need, let's put it all in a pandas DataFrame!

In [24]:
pd.read_sql_query(sql , con=con).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas